In [67]:
import pandas as pd
import numpy as np

In [6]:
obj = pd.Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj2 = pd.Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2.dtype

dtype('int64')

In [15]:
s = pd.Series([9904312, 3448737, 2890451, 2466052], index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [16]:
s.name = "인구"
s.index.name = "도시"
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [17]:
s / 1000000

도시
서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
Name: 인구, dtype: float64

In [19]:
s[1], s["부산"]

3448737

In [21]:
s[[0, 3, 1]]

도시
서울    9904312
대구    2466052
부산    3448737
Name: 인구, dtype: int64

In [22]:
s[[3]]

도시
대구    2466052
Name: 인구, dtype: int64

In [25]:
s >= 2500000

도시
서울     True
부산     True
인천     True
대구    False
Name: 인구, dtype: bool

In [28]:
s[s>= 2500000]

도시
서울    9904312
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [31]:
s[s <= 5000000]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [32]:
s[ (s >= 2500000) & (s <= 5000000)]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [33]:
s[(s < 2500000) | (s> 5000000)]

도시
서울    9904312
대구    2466052
Name: 인구, dtype: int64

In [34]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [35]:
s["부산":"대구"]

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [65]:
population_number = pd.read_csv("population_number.csv", encoding="utf-8", index_col='도시')

In [46]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437
인천  수도권  2890451  2632035.0        NaN  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [50]:
population_number['2010'].sort_values()

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [51]:
population_number['2010'].sort_values(ascending=True)

도시
대구    2431774.0
인천    2632035.0
서울    9631482.0
부산          NaN
Name: 2010, dtype: float64

In [56]:
population_number.sort_values(by='2010', ascending=True)

     지역     2015       2010       2005     2000
도시
대구  경상권  2466052  2431774.0  2456016.0  2473990
인천  수도권  2890451  2632035.0        NaN  2466338
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        NaN        NaN  3655437

In [60]:
population_number.fillna(value=0, inplace=True)

In [61]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        0.0        0.0  3655437
인천  수도권  2890451  2632035.0        0.0  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [66]:
population_number.count()

지역      4
2015    4
2010    3
2005    2
2000    4
dtype: int64

In [64]:
population_number

     지역     2015       2010       2005     2000
도시
서울  수도권  9904312  9631482.0  9762546.0  9853972
부산  경상권  3448737        0.0        0.0  3655437
인천  수도권  2890451  2632035.0        0.0  2466338
대구  경상권  2466052  2431774.0  2456016.0  2473990

In [74]:
s2 = pd.Series(np.random.randint(6, size= 100))

In [75]:
s2

0     3
1     5
2     0
3     3
4     2
     ..
95    0
96    0
97    2
98    3
99    5
Length: 100, dtype: int32

In [76]:
s2.value_counts()

2    25
3    18
1    18
0    17
4    12
5    10
dtype: int64